#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/orga_vis/snowflake_project_workspace_TEST/runs/run-Wno2UjVysptEJmFm

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_account_role.role will be created
  + resource "snowflake_account_role" "role" {
      + comment              = "Main role for Snowflake POC account usage"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "TEST_POC_VISEO_ROLE"
      + show_output          = (known after apply)
    }

  # snowflake_database.db will be created
  + resource "snowflake_database" "db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Main dev database"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "TEST_POC_VISEO_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

  # snowflake_grant_account_role.grants will be created
  + resource "snowflake_grant_account_role" "grants" {
      + id        = (known after apply)
      + role_name = "TEST_POC_VISEO_ROLE"
      + user_name = "ADMIN_USER"
    }

  # snowflake_grant_account_role.rolegrant will be created
  + resource "snowflake_grant_account_role" "rolegrant" {
      + id               = (known after apply)
      + parent_role_name = "SYSADMIN"
      + role_name        = "TEST_POC_VISEO_ROLE"
    }

  # snowflake_grant_privileges_to_account_role.database_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "database_grant" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE SCHEMA",
          + "MODIFY",
          + "MONITOR",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_account_object {
          + object_name = "TEST_POC_VISEO_DB"
          + object_type = "DATABASE"
        }
    }

  # snowflake_grant_privileges_to_account_role.executetask will be created
  + resource "snowflake_grant_privileges_to_account_role" "executetask" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = true
      + privileges        = [
          + "EXECUTE MANAGED TASK",
          + "EXECUTE TASK",
          + "MONITOR EXECUTION",
        ]
      + with_grant_option = false
    }

  # snowflake_grant_privileges_to_account_role.future_tables_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "future_tables_grant" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "INSERT",
          + "SELECT",
        ]
      + with_grant_option = false

      + on_schema_object {
          + future {
              + in_database        = "TEST_POC_VISEO_DB"
              + object_type_plural = "TABLES"
            }
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_bronze will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_bronze" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_gold will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_gold" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_monitoring will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_monitoring" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"MONITORING_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_raw will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_raw" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE EXTERNAL TABLE",
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_silver will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_silver" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.warehouse_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "warehouse_grant" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_account_object {
          + object_name = "TEST_WH"
          + object_type = "WAREHOUSE"
        }
    }

  # snowflake_schema.bronze_layer will be created
  + resource "snowflake_schema" "bronze_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "BRONZE_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.gold_layer will be created
  + resource "snowflake_schema" "gold_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "GOLD_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.monitoring_layer will be created
  + resource "snowflake_schema" "monitoring_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "MONITORING_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.raw_layer will be created
  + resource "snowflake_schema" "raw_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "RAW_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.silver_layer will be created
  + resource "snowflake_schema" "silver_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "SILVER_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_table.change_history_table will be created
  + resource "snowflake_table" "change_history_table" {
      + change_tracking             = false
      + comment                     = "Schemachange history table"
      + data_retention_time_in_days = -1
      + database                    = "TEST_POC_VISEO_DB"
      + fully_qualified_name        = (known after apply)
      + id                          = (known after apply)
      + name                        = "CHANGE_HISTORY"
      + owner                       = (known after apply)
      + schema                      = "MONITORING_LAYER"

      + column {
          + name                    = "VERSION"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "DESCRIPTION"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "SCRIPT"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "SCRIPT_TYPE"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "CHECKSUM"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "EXECUTION_TIME"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "NUMBER"
        }
      + column {
          + name                    = "STATUS"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "INSTALLED_BY"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "VARCHAR"
        }
      + column {
          + name                    = "INSTALLED_ON"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "TIMESTAMP_LTZ"
        }
    }

  # snowflake_warehouse.warehouse will be created
  + resource "snowflake_warehouse" "warehouse" {
      + auto_resume                         = "default"
      + auto_suspend                        = 60
      + enable_query_acceleration           = "default"
      + fully_qualified_name                = (known after apply)
      + id                                  = (known after apply)
      + max_concurrency_level               = (known after apply)
      + name                                = "TEST_WH"
      + parameters                          = (known after apply)
      + query_acceleration_max_scale_factor = -1
      + show_output                         = (known after apply)
      + statement_queued_timeout_in_seconds = (known after apply)
      + statement_timeout_in_seconds        = (known after apply)
      + warehouse_size                      = "small"
    }

Plan: 20 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @WalidVis, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*